app/controllers/bookings_controller.rb

  def new
    @pokemon = Pokemon.find(params[:pokemon_id])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @booking = Booking.new(booking_params)
    @pokemon = Pokemon.find(params[:pokemon_id])
    @booking.user = current_user
    @booking.pokemon = @pokemon
    if @booking.save!
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "pokemon_id", "created_at", "updated_at", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 11], ["pokemon_id", 6], ["created_at", "2021-05-14 10:37:47.606525"], ["updated_at", "2021-05-14 10:37:47.606525"], ["start_date", "2021-05-03"], ["end_date", "2021-05-10"]]

  def find_booking
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 511], ["LIMIT", 1]]