app/controllers/pokemons_controller.rb

DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 151]]
---
  def destroy
    @pokemon.destroy

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 151], ["LIMIT", 1]]
---
  def find_pokemon
    @pokemon = Pokemon.find(params[:id])